<template>
	<view>
		<view class="p-15 u-f-dc">
			<text>风险提示</text>
			<text>FIL会发生价格波动的情况，且产出难度会不定期调整。市场价值波动或产出难度调整都可能导致产出变动无论从数字资产还是法币角度，本产品不对产出做任何承诺，因产出难度、市场价值波动等因素。导致产出的数字资产价值变动，由用户自行承担。发行方对本合约条款保留所有解释权。</text>
			<text>2、本合同不涉及数字资产交易，若用户自行参与第三方的数字资产交易，应当自行承担责任和风险。</text>
			<text>3、用户理解并同意，如发生合同所约定的合同订立时不能预见、不能避免且不能克服的客观情况而导致合同无法继续履行的，本合同自动终止，合同各方互不承担责任，由此造成的损失须各方自行承担，用户已支付的费用不予退还。</text>
			
			
			
			<text>FIL联合封装</text>
			<text>规则介绍</text>
			<text>规则说明</text>
			<text>1、FIL提供方为存储设备持有者一次性提供封存所需的 pledge FIL，pledge周期为540天;封存完成540天后一次性返还pledge;</text>
			<text>2、Pledge FIL根据当前主网数据上浮10%估算(pledge需求*110%)，下单后冻结在FIL联合封装账户;如pledge FIL提前耗尽则本次联合封装封存周期结束，FIL提供者按照实际pledge FIL数获得产出分成;如封存周期结束后有剩余将直接返还;</text>
			<text>3、Pledge FIL冻结期间，FIL提供方可获得实际pledge FIL数量45%的分成，每日分成数量为联合封装部分当日产出的35%，直至获得约定分成数量;如果pledge周期内联合封装产出未能支付完约定分成数量，则存储设备方后续产出将优先支付完分成;</text>
			<text>4、FIL提供方无需承担GAS费;</text>
		
			<text>联合封装协议</text>
			<text>本《联合封装协议》（下称“本协议”）是FIL提供方与算力机持有者就FIL提供方为算力机持有者所拥有的IPFS独立算力机设备提供质押FIL进行FIL联合封装（以下称“本服务”）等相关事项签订的合同。在使用本服务前，FIL提供方与算力机持有者均应当充分阅读、理解本协议，其中限制、免责条款或者其他涉及各方重大权益的条款（如违约处罚、争议管辖等）可能会以加粗、加下划线等形式提示各方重点注意。除非各方已充分阅读、理解并同意接受和遵守本协议，否则，请各方不要使用本服务。各方通过网页确认或以其他任何方式明示或者默示表示接受本协议，或各方以任何方式使用本服务的，即视为各方已阅读并同意接受本协议的约束，本协议即在各方之间产生法律效力。</text>
			
			<text>使用本服务应当遵守本协议、IPFS/Filecoin协议实验室官方发布的规则（以下称“FIL官方规则”）以及相关网页发布的服务规则或服务说明。各方应事先全面了解上述相关规则，并根据上述相关规则进行操作，以确保顺利使用。</text>
			
			<text>基于网络服务的及时性、复杂性、高效性等特性及监管要求、政策调整以及FIL官方规则的变化等原因，各方均同意BHPay 有权不时对相关规则进行调整、更新，并通过网站公告、邮件通知、短信通知、系统消息、站内信、即时通讯工具（如微信、QQ等）等方式中的一种或多种予以公布，上述内容一经公布即为本协议不可分割的组成部分；若各方在调整、更新后仍继续使用本服务的，表示各方已充分阅读、理解并接受调整、更新后的内容，也将遵循调整、更新后的内容。</text>
			
			<text>第一条 释义</text>
			
			<text>除非另有约定，本协议项下的相关词语、术语均以本条下列释义、表述为准。</text>
			
			<text>1.1 算力机持有者：指对本协议项下标的独立算力机享有合法、完整的所有权且就标的独立算力机发出本次FIL联合封装服务申请的RRMine平台用户。</text>
			
			<text>1.2 FIL提供方：指对本协议项下所提供的质押FIL享有合法、完整的所有权的RRMine平台用户。</text>
			
			<text>1.3 标的独立算力机：指算力机持有者通过RRMine平台所购买的，并发出本次FIL联合封装服务申请的IPFS独立算力机设备。</text>
			
			<text>1.4 新增有效算力：指FIL提供方为标的独立算力机提供质押FIL后，标的独立算力机用以完成待封存存储容量的有效封存后所获得的新增的有效算力。</text>
			
			<text>1.5 FIL质押：指在IPFS/FIL协议项下，节点为完成对算力机所包含存储容量进行有效封存而需向IPFS/FIL主网提交相应数量的FIL以作为质押，本协议项下每日新增有效算力对应的FIL质押的质押周期为540天。</text>
			
			<text>1.6 FIL联合封装订单：指算力机持有者就标的独立算力机提出联合封装服务申请后，经平台审核通过所生成的FIL联合封装订单，FIL提供方勾选下单并点击确认本协议后，即视为算力机持有者与FIL提供方之间就本次联合封装服务达成合意，本协议即在算力机持有者与FIL提供方之间发生法律效力。以下简称“本订单”。</text>
			
			<text>1.7 待封存量：指FIL提供方点击下单时FIL联合封装订单显示的待封存存储容量。</text>
			
			<text>1.8 封存速率：指FIL联合封装订单所显示的封存速率仅为标的独立算力机依据其自身性能以及执行的封存扇区方案，根据现有技术及FIL官方规则，理论上平均每日能完成封存的新增算力数量，以实际速率为准。</text>
			
			<text>1.9 FIL产出：指标的独立算力机连接IPFS/Filecoin主网运行后，在提供相应的FIL质押并支付相应的主网运行成本后完成有效封存所形成的有效算力获得的爆块奖励（FIL通证），包括立即释放部分和线性释放部分。</text>
			
			<text>1.10 主网运行成本：指标的独立算力机IPFS/FIL主网正常运行所必需承担的成本，包括但不限于gas费用等。本协议项下的标的独立算力机的主网运行成本由算力机持有者自行承担。</text>
			
			<text>1.11 终端用户：指通过IPFS/FIL协议获取数据存储、检索服务的用户。</text>
			
			<text>1.12 双方/各方：指算力机持有者和FIL提供方双方/一方。</text>
		</view>
	</view>
</template>

<script>
	export default {
		name:"xieyi2",
		data() {
			return {
				
			};
		}
	}
</script>

<style>

</style>
