<template>
	<view class="p-10 u-f-dc">
		<view class="u-f u-f-ajc">
			<text class="f-b-w6 p-10">联合封装协议</text>
		</view>
		
		<text>	本《联合封装协议》（下称“本协议”）是FIL提供方与算力机持有者就FIL提供方为算力机持有者所拥有的IPFS独立算力机设备提供质押FIL进行FIL联合封装（以下称“本服务”）等相关事项签订的合同。在使用本服务前，FIL提供方与算力机持有者均应当充分阅读、理解本协议，其中限制、免责条款或者其他涉及各方重大权益的条款（如违约处罚、争议管辖等）可能会以加粗、加下划线等形式提示各方重点注意。除非各方已充分阅读、理解并同意接受和遵守本协议，否则，请各方不要使用本服务。各方通过网页确认或以其他任何方式明示或者默示表示接受本协议，或各方以任何方式使用本服务的，即视为各方已阅读并同意接受本协议的约束，本协议即在各方之间产生法律效力。</text>
	
		<text>使用本服务应当遵守本协议、
		IPFS/Filecoin协议实验室官方发布的规则（以下称“FIL官方规则”）以及相关网页发布的服务规则或服务说明。各方应事先全面了解上述相关规则，并根据上述相关规则进行操作，以确保顺利使用。</text>
		
		<text>基于网络服务的及时性、复杂性、高效性等特性及监管要求、政策调整以及FIL官方规则的变化等原因，各方均同意lmPRO 有权不时对相关规则进行调整、更新，并通过网站公告、邮件通知、短信通知、系统消息、站内信、即时通讯工具（如微信、QQ等）等方式中的一种或多种予以公布，上述内容一经公布即为本协议不可分割的组成部分；若各方在调整、更新后仍继续使用本服务的，表示各方已充分阅读、理解并接受调整、更新后的内容，也将遵循调整、更新后的内容。</text>
		
		<text class="f-b-w6 m-t-10">第一条 释义</text>
		
		<text>除非另有约定，本协议项下的相关词语、术语均以本条下列释义、表述为准。</text>
		
		<text>1.1 算力机持有者：指对本协议项下标的独立算力机享有合法、完整的所有权且就标的独立算力机发出本次FIL联合封装服务申请的Lm Pro平台用户。</text>
		
		<text>1.2 FIL提供方：指对本协议项下所提供的质押FIL享有合法、完整的所有权的Lm Pro平台用户。</text>
		
		<text>1.3 标的独立算力机：指算力机持有者通过Lm Pro平台所购买的，并发出本次FIL联合封装服务申请的IPFS独立算力机设备。</text>
		
		<text>1.4 新增有效算力：指FIL提供方为标的独立算力机提供质押FIL后，标的独立算力机用以完成待封存存储容量的有效封存后所获得的新增的有效算力。</text>
		
		<text>1.5 FIL质押：指在IPFS/FIL协议项下，节点为完成对算力机所包含存储容量进行有效封存而需向IPFS/FIL主网提交相应数量的FIL以作为质押，本协议项下每日新增有效算力对应的FIL质押的质押周期为540天。</text>
		
		<text>1.6 FIL联合封装订单：指算力机持有者就标的独立算力机提出联合封装服务申请后，经平台审核通过所生成的FIL联合封装订单，FIL提供方勾选下单并点击确认本协议后，即视为算力机持有者与FIL提供方之间就本次联合封装服务达成合意，本协议即在算力机持有者与FIL提供方之间发生法律效力。以下简称“本订单”。</text>
	
		<text>1.7 待封存量：指FIL提供方点击下单时FIL联合封装订单显示的待封存存储容量。</text>
		
		<text>1.8 封存速率：指FIL联合封装订单所显示的封存速率仅为标的独立算力机依据其自身性能以及执行的封存扇区方案，根据现有技术及FIL官方规则，理论上平均每日能完成封存的新增算力数量，以实际速率为准。</text>
		
		<text>1.9 FIL产出：指标的独立算力机连接IPFS/Filecoin主网运行后，在提供相应的FIL质押并支付相应的主网运行成本后完成有效封存所形成的有效算力获得的爆块奖励（FIL通证），包括立即释放部分和线性释放部分。</text>
		
		<text>1.10 主网运行成本：指标的独立算力机IPFS/FIL主网正常运行所必需承担的成本，包括但不限于gas费用等。本协议项下的标的独立算力机的主网运行成本由算力机持有者自行承担。</text>
		
		<text>1.11 终端用户：指通过IPFS/FIL协议获取数据存储、检索服务的用户。</text>
		
		<text>1.12 双方/各方：指算力机持有者和FIL提供方双方/一方。</text>
		<text class="f-b-w6 m-t-10">第二条 服务内容</text>
		
		<text>2.1 本协议项下FIL提供方按以下方式与算力机持有者进行FIL联合封装：即FIL提供方确认接受标的独立算力机的FIL联合封装订单，并按照该订单的规定一次性提供足额的质押FIL后，可按一定比例参与分配本订单项下完成有效封存所形成的有效算力获得的全部FIL产出，本订单项下全部新增有效算力所对应的FIL质押的质押周期届满后，算力机持有者应当一次性全部返还FIL提供方在本订单项下所提供的质押FIL。</text>
	
		<text>2.2 前款所述FIL联合封装订单规定的质押FIL的数量根据FIL提供方确认接受FIL联合封装订单时标的独立算力机的待封存量以及当时的FIL官方规则上浮20%预估确定，具体数量以实际发生数量为准。</text>
		
		<text>2.3 若发生本订单项下FIL提供方提供的质押FIL全部用完或者本订单项下标的独立算力机待封存量全部封满的情形之一的，本协议项下的FIL联合封装服务即告终止。服务终止时，FIL提供方所提供的质押FIL有剩余的，算力机持有者应将剩余的质押FIL全部返还给FIL提供方。</text>
		
		<text class="f-b-w6 m-t-10">第三条 协议期限</text>
		
		<text>本协议有效期为自双方通过网页确认或以其他任何方式明示或者默示表示接受本协议时起至本协议项下FIL提供方向标的独立算力机提供的FIL质押全部被返还时止。</text>
		
		<text class="f-b-w6 m-t-10">第四条 产出分配</text>
		
		<text>4.1本协议项下FIL提供方有权获得相当于本订单项下其所提供的用于完成全部新增有效算力封存而实际使用的质押FIL的45%的FIL总产出。</text>
		
		<text>4.2双方共同确认按以下方式进行产出分配：即FIL提供方每日按本订单项下已完成有效封存所形成的新增有效算力当日产出的FIL通证的35%进行划扣，直至完成前款所约定的FIL总产出的分配。</text>
		
		<text class="f-b-w6 m-t-10">第五条 免责声明</text>
		
		<text>5.1在任何情况下，FIL提供方不对算力机持有者使用本服务导致的任何直接、特殊、附带、偶然或间接的损害进行赔偿，无论基于合同、保证、侵权或任何其他责任理论，不论任一方是否知道或应当知道上述损失或损害的可能性。</text>
		<text>5.2 在其他任何情况下，FIL提供方不对标的独立算力机的运行及其产出以及该产出的价值做任何担保，也不承担任何责任。</text>
		
	
		<text>5.3 算力机持有者理解并同意，在使用本服务的过程中可能会遇到以下情况使服务发生中断。出现下述情况时，FIL提供方对由此给算力机持有者造成的损失不承担责任：</text>
		
		<text>5.3.1 不可抗力，包括但不限于自然灾害、政府行为、法律法规颁布调整、罢工（任一方内部劳资纠纷除外）、动乱等不能预见、不能避免并不能克服的客观情况。</text>
		
		<text>5.3.2 基础运营商原因，包括但不限于电信部门技术调整、电信/电力线路被他人破坏、电信/电力部门对电信网络/电力资源进行安装、改造、维护。</text>
		
		<text>5.3.3 网络安全事故，如计算机病毒、木马或其他恶意程序、黑客攻击的破坏。</text>
		
		<text>5.3.4 算力机持有者操作不当或标的独立算力机设备软件、系统、硬件和通信线路出现故障。</text>
		
		<text>5.3.5 因第三方产品、设备、网络故障导致的标的独立算力机不可运行。</text>
		
		<text>5.3.6 因不可归责于FIL提供方的原因导致有关司法机关、监管机构等政府部门对标的独立算力机设备进行没收、查封、扣押、冻结或其它强制措施造成的任何损失。</text>
	
		<text>5.3.7其他非FIL提供方过错、FIL提供方无法控制或合理预见的情形。</text>
		
		<text>5.4 因不可抗力、基础运营商原因、网络安全事故或其他超出当事人可合理掌控范围的事件，造成本协议迟延履行或任何一方违约，双方均无需承担违约责任。但是，受影响一方应尽可能及时通知另一方。如前述事件妨碍协议履行达30天以上的，任一方可提前15天书面通知对方终止协议。因本条款终止协议的，任何一方均无须承担违约责任。</text>
		
		<text>5.5 在履行本协议期间，FIL提供方对因算力机持有者本人或第三方的产品/服务而给算力机持有者或者其他方造成的损失不负责任。</text>
		
		<text>5.6 于任何情形下，FIL提供方基于本协议向算力机持有者所承担的赔偿责任（无论基于合同、侵权或任何其他责任理论）的总额，不超过算力机持有者就造成算力机持有者损失的本协议项下FIL提供方所获得的FIL产出。</text>
		
		<text class="f-b-w6 m-t-10">第六条 承诺与保证</text>
		
		<text>6.1各方应保证其是合法存续的法人或具有完全民事行为能力和民事权利能力的自然人，有能力及权利签订和履行本协议；算力机持有者接受并使用FIL提供方提供的本次服务，在算力机持有者的居住地/国家符合适用法律法规和相关政策，且不违反算力机持有者对于任何其他第三方的义务；FIL提供方提供本次服务，在FIL提供方的居住地/国家符合适用法律法规和相关政策，且不违反FIL提供方对于任何其他第三方的义务。</text>
		<text>6.2 算力机持有者保证对标的独立算力机享有合法的、完整的权利，有权对其进行处分，并保证FIL提供方不会因为向算力机持有者提供本次服务而被第三人主张权利。</text>
		<text>6.3算力机持有者保证标的独立算力机用于合法合理之目的，不得用于非法销售、发布计算机病毒、网络攻击、网络入侵等侵害网络信息安全以及洗钱、逃税等违法行为。</text>
		<text>	6.4算力机持有者保证本协议项下FIL提供方所提供FIL全部用于FIL官方规则所要求的、标的独立算力机为完成对待封存量的全部有效封存所需提供的FIL质押，不得挪作他用，否则，FIL提供方有权提前终止本协议，并收回其所提供的全部质押FIL。</text>
		<text>6.5各方保证均未被美国政府列在“实体清单”(“Entity List”)，“拒绝.人员名单”(“Denied Persons List”)或者“特别指定国民名单”(“SDNList" )，也非直接或间接属于或受控于上述名单中的任何主体，也不受任何美国、中国、欧盟及其成员国的进出口管制、制裁或限制。各方保证其提供的所有信息均为真实、准确的，且不含任何虚假或误导性的陈述。</text>
		<text class="f-b-w6 m-t-10">第七条 双方的权利与义务</text>
		<text>7.1 算力机持有者应自行负责标的独立算力机及其运行，包括其硬件、软件、系统、网络宽带、电力等，因这些因素导致标的独立算力机新增或已有效算力及其产出发生算力减损的，由算力机持有者自行承担，FIL提供方不承担责任。</text>
		<text>7.2 本协议生效后，FIL提供方应按照FIL官方规则以及本协议的约定及时、足额为标的独立算力机提供FIL质押。FIL提供方按本协议的约定及时、足额为标的独立算力机提供FIL质押后，算力机持有者应保证标的独立算力机每日持续新增有效算力。</text>
		<text>7.3 如算力机持有者发生下列情形之一，导致FIL提供方提供的质押FIL被没收或发生损失以及FIL提供方预期可得FIL产出减损的，算力机持有者应采取一切合理手段减少损失，算力机持有者承诺对FIL提供方因此遭受的损失予以赔偿，在此情况下，算力机持有者同意FIL提供方可直接抵减算力机持有者在本协议项下的权益，若该权益不足以弥补损失的，FIL提供方有权继续追偿：</text>
		<text>7.3.1未能或未及时提供存储证明；</text>
		<text>7.3.2未能履行与终端用户的合约；</text>
		<text>7.3.3长时间离线、作假、重力攻击等违反共识的行为；</text>
		<text>7.3.4其他导致存储扇区丢失或损失的情形。</text>
		<text>7.4 本订单项下全部新增有效算力所对应的FIL质押的质押周期届满后，算力机持有者应当一次性全部返还FIL提供方在本订单项下所提供的质押FIL，到期未足额偿还部分，FIL提供方有权直接从算力机持有者相关FIL账户余额中予以划扣。</text>
		<text>7.5 本服务终止时，FIL提供方所提供的质押FIL如有剩余的，算力机持有者应立即向FIL提供方返还未使用的部分。算力机持有者理解并同意，FIL提供方有权直接从算力机持有者相关FIL关联账户中予以划扣。</text>
		<text>7.6服务期内，未经算力机持有者的同意，FIL提供方不得提前收回本协议第二条所约定的质押FIL。</text>
		<text>7.7如因算力机持有者的原因导致FIL提供方遭受第三人主张权利，FIL提供方可在对第三人承担金钱给付等义务后就全部损失向算力机持有者追偿。在此情况下，算力机持有者同意FIL提供方可直接抵减算力机持有者在本协议项下的权益，若该权益不足以弥补损失的，FIL提供方有权继续追偿。</text>
		<text class="f-b-w6 m-t-10">第八条 保密</text>
		<text>8.1 双方应当对本协议的内容、因履行本协议或在本协议期间获得的或收到的对方未公开的商务、财务、技术、产品的信息、用户资料或其他标明保密的文件或信息的内容(简称“保密资料”)保守秘密，未经信息披露方书面事先同意，不得向本协议以外的任何第三方披露。资料接受方可仅为本协议目的向其确有知悉必要的雇员披露对方提供的保密资料，但同时须指示其雇员遵守本条规定的保密及不披露义务。双方应仅为本协议目的而复制和使用保密资料。若因不当使用或泄露相关商业秘密给对方或第三方造成损失的，违约方承担全部赔偿责任。</text>
		<text>8.2上述保密条款不因本协议的解除、终止、撤销、无效而失效。</text>
		<text class="f-b-w6 m-t-10">第九条 违约责任与协议解除</text>
		<text>9.1 除本协议另有约定外，任何一方直接或间接违反本协议的任何条款，或不承担或不及时、充分地承担本协议项下其应承担的义务即构成违约行为，守约方有权通知要求违约方纠正其违约行为并采取充分、有效、及时的措施消除违约后果，并赔偿守约方因违约方之违约行为而遭致的直接经济损失；自守约方发出书面通知之日起30日内，如违约方未对违约行为予以纠正的，则自守约方发出书面通知30日届满之日，守约方可立即单方解除本协议。</text>
		<text>9.2 本协议将在下列条件之一成就时终止/解除：</text>
		<text>9.2.1 一方违约，守约方按协议约定解除本协议的；</text>
		<text>9.2.2 双方针对本协议签署终止/解除的法律文件；</text>
		<text>9.2.3 协议有效期届满且双方无意续约的。</text>
		<text>9.3 本协议无论因任何原因被解除或终止，不影响协议终止前已经产生的权利义务。</text>
		
		<text class="f-b-w6 m-t-10">第十条  争议解决</text>
		<text>10.1本协议按照中华人民共和国大陆地区的法律执行与解释。</text>
		<text>10.2因本协议引起的或与本协议有关的任何争议，双方可协商解决；若协商不成，任何一方均可提交海南国际仲裁院按照当时有效的仲裁规则进行仲裁，仲裁裁决是终局的，对双方均有法律约束力。</text>
		
		<text class="f-b-w6 m-t-10">第十一条 其他</text>
		<text>11.1算力机持有者点击确认同意本协议即表示算力机持有者向FIL提供方发出了联合封装服务的申请，且该申请是不可撤销的；FIL提供方勾选下单上述申请所生成的FIL联合封装订单并点击确认同意本协议，即视为FIL提供方接受了算力机持有者的上述申请，双方即就本次联合封装服务达成合意，本协议即在算力机持有者与FIL提供方之间发生法律效力。</text>
		<text>11.2 本协议于有效期届满或发生法律、法规所规定的终止情形时终止。本协议的终止，不影响协议中结算和清理条款的效力。</text>
		<text>11.3如果本协议任何条款被确定为无效或无法实施，本协议的其他所有条款将继续有效。此种情况下，双方将以有效的约定替换该无效或无法实施约定，且该有效约定应尽可能接近原约定和本协议相应的精神和宗旨。</text>
		<text>	11.4除本协议另有约定外，与履行本协议有关的各项通知，均应向本协议项下各方提供的联系方式发出。如一方联系方式有变，应事先将信息变更事项通知另一方，另一方实际收到变更通知前按原联系方式的送达仍为有效送达。BHPay可通过网页公告、系统通知、站内信、电子邮件、手机短信、即时通讯工具、函件等方式中的一种或多种向各方发送与本产品/服务有关的业务通知、产品/服务提示、验证消息、营销信息等各种信息（包括但不限于更新后的产品/服务规则、产品/服务升级、广告等）。</text>
		<text class="f-b-w6 m-t-10">前述信息在以下情况下视为已送达：</text>
		<text>11.4.1交专人递送的，在收件人签收时视为已送达。</text>
		<text>11.4.2以网页公告等形式公布的，一经公布即生效（另有说明除外）。</text>
		<text>11.4.3以电子形式（包括系统通知、站内信、电子邮件、手机短信、即时通讯工具等）发送的，在发送成功后视为已送达。</text>
		<text>11.4.4以邮资预付的快递公司递送或以挂号信递送的，以投邮后的第3个自然日视为已送达。</text>
		<text>11.5本协议由本协议条款的内容、平台相关页面上展现的产品/服务规则、规范，产品/服务说明（含操作文档）和各方点击确认的其他条款/条件组成，算力机持有者和FIL提供方均受其约束，且其中的相关名词可相互引用、解释。</text>
	

	</view>
</template>

<script>
	export default {
		name:"xieyi",
		data() {
			return {
				
			};
		}
	}
</script>

<style>

</style>
